{"path":"blog/desktop-beta","templateID":11,"sharedPropsHashes":{},"localProps":{"posts":[{"title":"Desktop Beta","slug":"desktop-beta","category":"updates","date":"Mon Feb 12 2018 07:00:00 GMT+0700 (+07)","contents":"<p>Thanks for checking out the beta! The main goals of these changes are to make Moo.do more intuitive for new users and to focus on being a killer task management app.</p>\n<p>You can use the beta version of the web app at <a href=\"https://beta.moo.do/web/\">https://beta.moo.do/web/</a> or download the beta version of the <span class=\"platformName\"/> app at <a href=\"https://beta.moo.do/download/\">https://beta.moo.do/download/</a>. In the app you will see a “Use beta version” checkbox in the <span class=\"onlyMac\">Moo.do</span><span class=\"onlyWin\">File</span> menu to toggle between the beta version and the normal version.<span class=\"onlyWin\"> You may need to press Alt to open the File menu.</span></p>\n<h1 id=\"new-design\">New design</h1>\n<p>We’ve updated the design of the app to look more modern and emphasize important parts of the UI while deemphasizing less used features.\n<img class=\"postImg postImgBeta\" src=\"/blog/img/update-desktop-beta1.png\" /></p>\n<h1 id=\"new-views\">New views</h1>\n<h2 id=\"project-view\">Project View</h2>\n<p>While we love the Outline for quickly laying out projects and tasks, it’s not always the best way to visualize projects to be done, and we found it’s not intuitive for users coming from other task management apps.</p>\n<p>Moo.do’s new Project View retains all the power of the Outline with collapsible nodes, but is laid out in a more familiar view grouped by project.\n<img class=\"postImg postImgBeta\" src=\"/blog/img/update-desktop-beta2.png\" /></p>\n<h2 id=\"tag-contact-priority-views\">Tag, Contact, Priority views</h2>\n<p>For those people who like to organize with Tags (as context for GTD or to separate phases of a project), the Tag view makes it easy to view projects laid out by task and drag items between tag blocks. It’s similarly easy to manage and reorganize tasks by contact or priority.\n<img class=\"postImg postImgBeta\" src=\"/blog/img/update-desktop-beta3.png\" /></p>\n<h2 id=\"agenda-view\">Agenda view</h2>\n<ul>\n<li>The Agenda has three view options to focus on what’s due now or what’s next: <b>Today</b>, <b>Week</b>, and <b>All</b>.</li>\n<li>It shows the full context of each item for clarity in case of multiple similarly named tasks.</li>\n<li>And it just looks nicer.</li>\n</ul>\n<p>Additionally, each pane’s view mode can be changed on the fly, to make it easy to view the project and search you’re looking at in a different way.</p>\n<h1 id=\"hide-when-completed\">Hide when completed</h1>\n<ul>\n<li>The completed items search filters now hides by default</li>\n<li>Completing items fade away and hide after a second, so they don’t clutter up your view</li>\n<li>The completed items filter can show completed items or show only completed items</li>\n<li>This actually applies to all search. If an item’s text is changed so that it no longer matches search, it will hide from view.</li>\n<li>Because completed item management works better now, archiving completed items is less relevant so the button is moved to the pane options menu.</li>\n</ul>\n<h1 id=\"search\">Search</h1>\n<ul>\n<li>You can now use or in search (or || if you’re a programmer) to show results from multiple searches</li>\n<li>Search is now a simple box that opens a popup with all the options, and helpful hints for how to use search\n<img class=\"postImg postImgBetaSmall\" src=\"/blog/img/update-desktop-beta4.png\" style=\"height: 240px;\" /></li>\n</ul>\n<h1 id=\"sidebar-and-top-bar\">Sidebar and top bar</h1>\n<p>The sidebar is now resizeable and can be fully hidden. When the sidebar is hidden, the boards and buttons are moved into a new bar at the top.</p>\n<h1 id=\"board-management\">Board management</h1>\n<ul>\n<li>The options menu of each pane now has an “Open pane in new board” option.</li>\n<li>The boards in the sidebar have a new option to create a copy of the board</li>\n</ul>\n<h1 id=\"focus-on-task-management\">Focus on task management</h1>\n<ul>\n<li>Items will have a task prefix by default, which can be changed in the settings</li>\n<li>Removed the hover checkbox to make the checkbox on the left the way to complete tasks</li>\n<li>Hotkeys to change prefix (not in this release yet)</li>\n</ul>\n<h1 id=\"overview\">Overview</h1>\n<ul>\n<li>Button at the top of the overview to show all projects</li>\n<li>“Add project” buttons at the top and bottom to quickly add projects from the overview</li>\n</ul>\n<h1 id=\"calendar-pane-is-now-free\">Calendar pane is now free</h1>\n<p>We feel the calendar is a core feature of Moo.do, so we’re making it free. The Google Calendar sync remains premium.</p>\n<h1 id=\"miscellenous\">Miscellenous</h1>\n<ul>\n<li>A move icon on left to show that items are draggable, and clicking it shows a menu</li>\n<li>Collapsing is faster</li>\n</ul>\n<h1 id=\"help-us-improve\">Help us improve</h1>\n<p>Please let us know if you find any issues or have any suggestions. The best way to do that for the beta is post in the Moo.do Slack. If you’re not on the Slack and would like to join, send us an email to <a href=\"mailto:contact@moo.do\">contact@moo.do</a>.</p>\n<style>\n.postImgBetaSmall {\n    margin: 24px auto;\n    width: auto;\n}\n</style>\n"}],"isSinglePost":true}}
